// 디지털 영상은 보통 2차원 배열로 표현된다. 하나의 픽셀은 보통 0- 255를 가진다.
// 0은 검정색, 255는 흰색, 중간값은 회색, 영상은 unsigned char image[ROWS][COLS]에
// 저장되어 있다고 가정하고 픽셀 값이 128미만이면 0으로 만들고 128이상이면 255로 만들자
#include <stdio.h>
#define ROWS 10
#define COLS 10

int main(void)
{

    int image[10][10] = {
        {1, 2, 3, 4, 5, 6, 7, 8, 200, 1},
        {1, 2, 3, 4, 5, 6, 7, 8, 200, 1},
        {1, 2, 222, 4, 5, 6, 7, 8, 200, 1},
        {1, 2, 3, 4, 5, 6, 7, 8, 200, 1},
        {1, 2, 3, 4, 5, 6, 7, 8, 200, 1},
        {1, 2, 3, 4, 5, 6, 7, 8, 200, 1},
        {1, 2, 3, 4, 33, 6, 7, 8, 200, 1},
        {1, 2, 3, 4, 5, 6, 7, 8, 200, 1},
        {1, 2, 3, 4, 5, 6, 7, 8, 200, 1},
        {1, 2, 3, 4, 5, 209, 7, 8, 200, 999},
    };
    int *p;
    int *endp; 
    int i;

    p = &image[0][0];
    endp = &image[9][9];
    printf("%d\n", *p);

    while (*p != *endp)
    {
        if (*p < 128)
            *p = 0;
        else
            *p = 255;
        p++;
    }

    int q, w;
    for (q = 0; q < 10; q++)
    {
        for (w = 0; w < 10; w++)
        {
            printf("%d ", image[q][w]);
        }
        printf("\n");
    }

    return 0;
}